In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, '8', datetime.datetime(2018, 11, 1, 22, 1, 46, 796000), 'free', '698D73EE9CDE49C0A7', '23D12945269F453EB5', '139', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (2, '8', datetime.datetime(2018, 11, 1, 22, 5, 52, 796000), 'free', '1FD7E377A84342C18B', 'AA51CEE43CF047DAB6', '139', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (3, '8', datetime.datetime(2018, 11, 1, 22, 8, 16, 796000), 'free', '9DA12F44458543D190', '500C9E08B28941DB85', '139', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (4, '8', datetime.datetime(2018, 11, 1, 22, 11, 13, 796000), 'free', '0EC5672C922149EBB9', '468E88FDAFBC4FE698', '139', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (5, '8', datetime.datetime(2018, 11, 1, 22, 17, 33, 796000), 'free', 'A587D90577584016A3', '0627C8C22C624E39A4', '139', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('54', 'Kaleb', 'Cook', 'M', 'free'),
 ('83', 'Stefany', 'White', 'F', 'free'),
 ('11', 'Christian', 'Porter', 'F', 'free'),
 ('3', 'Isaac', 'Valdez', 'M', 'free'),
 ('32', 'Lily', 'Burns', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 219),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, 177),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 210)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892')),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', None, None),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', None, None),
 ('ARXR32B1187FB57099', 'Gob', '', None, None),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', None, None)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 22, 1, 46, 796000), 22, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 22, 5, 52, 796000), 22, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 22, 8, 16, 796000), 22, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 22, 11, 13, 796000), 22, 1, 44, 11, 2018, 3),
 (datetime.datetime(2018, 11, 1, 22, 17, 33, 796000), 22, 1, 44, 11, 2018, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).